barathbushan/CanDriverOnFreeRTOS/code/Project-Folder/FreeRTOS-Products/FreeRTOS-Plus-IO/Device/LPC17xx/FreeRTOS_lpc17xx_ssp.c
/*
 * FreeRTOS+IO V1.0.1 (C) 2012 Real Time Engineers ltd.
 *
 * FreeRTOS+IO is an add-on component to FreeRTOS.  It is not, in itself, part
 * of the FreeRTOS kernel.  FreeRTOS+IO is licensed separately from FreeRTOS,
 * and uses a different license to FreeRTOS.  FreeRTOS+IO uses a dual license
 * model, information on which is provided below:
 *
 * - Open source licensing -
 * FreeRTOS+IO is a free download and may be used, modified and distributed
 * without charge provided the user adheres to version two of the GNU General
 * Public license (GPL) and does not remove the copyright notice or this text.
 * The GPL V2 text is available on the gnu.org web site, and on the following
 * URL: http://www.FreeRTOS.org/gpl-2.0.txt
 *
 * - Commercial licensing -
 * Businesses and individuals who wish to incorporate FreeRTOS+IO into
 * proprietary software for redistribution in any form must first obtain a low
 * cost commercial license - and in-so-doing support the maintenance, support
 * and further development of the FreeRTOS+IO product.  Commercial licenses can
 * be obtained from http://shop.freertos.org and do not require any source files
 * to be changed.
 *
 * FreeRTOS+IO is distributed in the hope that it will be useful.  You cannot
 * use FreeRTOS+IO unless you agree that you use the software 'as is'.
 * FreeRTOS+IO is provided WITHOUT ANY WARRANTY; without even the implied
 * warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR
 * PURPOSE. Real Time Engineers Ltd. disclaims all conditions and terms, be they
 * implied, expressed, or statutory.
 *
 * 1 tab == 4 spaces!
 *
 * http://www.FreeRTOS.org
 * http://www.FreeRTOS.org/FreeRTOS-Plus
 *
 */

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

/* IO library includes. */
#include "FreeRTOS_IO.h"
#include "IOUtils_Common.h"
#include "FreeRTOS_ssp.h"

/* Hardware setup peripheral driver includes.  The includes for the SSP itself
is already included from FreeRTOS_IO_BSP.h. */
#include "lpc17xx_pinsel.h"

/* The maximum number of characters that can be in the Rx FIFO. */
#define sspMAX_FIFO_DEPTH				( 8 )

/* All the interrupts associated with receiving on the SSP. */
#define sspALL_SSP_RX_INTERRUPTS 		( SSP_INTCFG_RT | SSP_INTCFG_RX | SSP_INTCFG_ROR )

/* The interrupts that are associated with data having been received on the
SSP. */
#define sspRX_DATA_AVAILABLE_INTERRUPTS	( SSP_INTCFG_RT | SSP_INTCFG_RX )

/* A definition of configSPI_INTERRUPT_PRIORITY is required for compilation,
even if FreeRTOSIOConfig.h is configured to not include any interrupt driven
methods of transacting data. */
#ifndef configSPI_INTERRUPT_PRIORITY
	#define configSPI_INTERRUPT_PRIORITY configMIN_LIBRARY_INTERRUPT_PRIORITY
#endif /* configSPI_INTERRUPT_PRIORITY */

/*-----------------------------------------------------------*/

/*
 * Write bytes from ppucBuffer into the pxSSP FIFO until either all the bytes
 * have been written, or the FIFO is full.
 */
static size_t prvFillFifoFromBuffer( LPC_SSP_TypeDef * const pxSSP, uint8_t **ppucBuffer, const size_t xTotalBytes );

/*-----------------------------------------------------------*/

/* A structure is maintained for each possible Tx session on each possible SSP
port, and each possible Rx session on each possible SSP port.  These structures
maintain the state of the Tx or Rx transfer, on the assumption that a Tx or
Rx cannot complete immediately. */
static Transfer_Control_t *pxTxTransferControlStructs[ boardNUM_SSPS ] = { NULL };
static Transfer_Control_t *pxRxTransferControlStructs[ boardNUM_SSPS ] = { NULL };

/* Writing to the SSP will also cause bytes to be received.  If the only
purpose of writing is to send data, and whatever is received during the
send can be junked, then ulRecieveActive[ x ] will be set to false.  When the
purpose of sending is to solicit incoming data, and Rxed data should be
stored, then ulReceiveActive[ x ] will be set to true. */
static volatile uint32_t ulReceiveActive[ boardNUM_SSPS ] = { pdFALSE };

/* Maintain a structure that holds the configuration of each SSP port.  This
allows a single configuration parameter to be changed at a time, as the
configuration for all the other parameters can be read from the stored
structure rather than queried from the peripheral itself. */
static SSP_CFG_Type xSSPConfigurations[ boardNUM_SSPS ];

/* The CMSIS interrupt number definitions for the SSP ports. */
static const IRQn_Type xIRQ[ boardNUM_SSPS ] = { SSP0_IRQn, SSP1_IRQn };

/*-----------------------------------------------------------*/

portBASE_TYPE FreeRTOS_SSP_open( Peripheral_Control_t * const pxPeripheralControl )
{
PINSEL_CFG_Type xPinConfig;
portBASE_TYPE xReturn = pdFAIL;
LPC_SSP_TypeDef * const pxSSP = ( LPC_SSP_TypeDef * const ) diGET_PERIPHERAL_BASE_ADDRESS( pxPeripheralControl );
SSP_DATA_SETUP_Type *pxSSPTransferDefinition;
const int8_t cPeripheralNumber = diGET_PERIPHERAL_NUMBER( pxPeripheralControl );
volatile uint16_t usJunkIt;

	/* Sanity check the peripheral number. */
	if( cPeripheralNumber < boardNUM_SSPS )
	{
		/* Polled mode is used by default.  Create the structure used to
		transfer SSP data in polled mode. */
		pxSSPTransferDefinition = ( SSP_DATA_SETUP_Type * ) pvPortMalloc( sizeof( SSP_DATA_SETUP_Type ) );

		if( pxSSPTransferDefinition != NULL )
		{
			/* Create the transfer control structures in which references to
			pxSSPTransferDefinition will be stored. */
			vIOUtilsCreateTransferControlStructure( &( pxPeripheralControl->pxTxControl ) );
			vIOUtilsCreateTransferControlStructure( &( pxPeripheralControl->pxRxControl ) );

			if( ( pxPeripheralControl->pxTxControl != NULL ) && ( pxPeripheralControl->pxTxControl != NULL ) )
			{
				pxPeripheralControl->read = FreeRTOS_SSP_read;
				pxPeripheralControl->write = FreeRTOS_SSP_write;
				pxPeripheralControl->ioctl = FreeRTOS_SSP_ioctl;
				pxPeripheralControl->pxTxControl->pvTransferState = pxSSPTransferDefinition;
				pxPeripheralControl->pxTxControl->ucType = ioctlUSE_POLLED_TX;
				pxPeripheralControl->pxRxControl->pvTransferState = NULL;
				pxPeripheralControl->pxRxControl->ucType = ioctlUSE_POLLED_RX;

